Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.WireMaxSizeNonexistent
Cannot find max size in current wire type's material table.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnSwitchBoard
Need to replace spare or space on switchboard.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnPanelBoard
Need to replace spare or space on panelboard.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.PanelMismatchDistSysWhenCircuitAssigned
The selected circuit was added to panel [Element], but the distribution system for the panel does not match the power connector definition on the panel.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NumberOfCircuitFullOnSwitchPanel
You can't change the connection type to Breakers and connect to switchboard [Panel Name] because there aren't enough space. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailableForSwitchPanel
There aren't enough space on switchboard [Panel Name], so the circuit will connect through Feed Through Lugs.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailable
There aren't enough slots on panel [Panel Name], so the circuit will connect through Feed Through Lugs.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsOnPanel
You can't change the connection type to Breakers connect to panel  [Panel Name] because there aren't enough slots. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or open the panel schedule and manually reshuffle non - consecutive slots.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsAndLugsOnSwitchPanel
You can't connect to switchboard [Panel Name] because there aren't enough space and circuit [Circuit Name] is set to Feed Through Lugs. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers or you can disconnect circuit and select Feed Through Lugs again.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsAndLugsOnPanel
You can't connect to panel [Panel Name] because there aren't enough slots and Feed Through Lugs is occupied. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or you can disconnect existing Feed Through Lugs connection.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.MaximumNumberOfPolesExceeded
You cannot add more poles to this spare, as doing so would exceed the maximum number of poles set for this equipment.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidSpareSpace
The number of poles for a spare/space in a single phase, [wire] wires panel cannot exceed [value].

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidNumberOfCircuitValueForSwitchPanel
The number of circuits on the switchboard currently exceeds the value you entered. Reduce the number of circuits on the equipment before changing this value.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidApparentPowerDensity
The Apparent Power Density is invalid. Edit the Power Density and/or Power Factor to recalculate the Apparent Power Density.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits
The feed through lugs is occupied, so other circuits connected with feed through lugs will be disconnected from this panel [Panel Name].

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsOccupied
The feed through lugs is in use by circuit [Element].

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindGlobalParam
Can't change connection type to Feed Through Lugs because Feed Through Lugs is not enabled. Enable Feed Through Lugs by enabling the global parameter that Feed Through Lugs is mapping. Click Manage tab -> Settings panel -> Global Parameters.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsNotEnabledAndBindFormulaInFamily
Can't change connection type to Feed Through Lugs because Feed Through Lugs is unchecked. Enable Feed Through Lugs with related formula in family editor the Feed Through Lugs is mapped to. Select the panel -> Edit Family -> Family Types.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsDisabled
The feed through lugs option is unchecked.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitsOverlapDisconnectCircuits
More than one circuit falls onto the same slot. These circuits will be disconnected.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitsOverlapAndDeleteSpareSpace
More than one Spare/Space falls onto the same slot. These Spares/Spaces will be deleted.

Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CannotAddMorePolesToCircuit
Empty slots are unavailable to hold the number of poles you specified for this spare. \nTo add more poles to this spare, you must free up slots by moving the circuits below the spare.